In [3]:
#Ans:1
import pandas as pd
l = [4,8,15,16,23,42]

In [10]:
pd_series = pd.Series(l)

In [11]:
print(pd_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [12]:
#.Ans.2:-
list = ['a','d','r','t','y','u','i','o','h','l']

In [13]:
pd_series1=pd.Series(list)

In [14]:
print(pd_series1)

0    a
1    d
2    r
3    t
4    y
5    u
6    i
7    o
8    h
9    l
dtype: object

In [26]:
#Ans.3
dict = {'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']}

In [31]:
df = pd.DataFrame(dict)

In [32]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [35]:
#ANs:4
# Data Frame is a two dimensional data structure, Data stored in rows and columns. However Panda 
# Series is one dimensional data structure, It stored data like a column.
print(pd_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [36]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [45]:
#Ans.5:-
# Some Examples Data manipulation functions -
type(df)

pandas.core.frame.DataFrame

In [46]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [47]:
df.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [48]:
df.tail(1)

     Name  Age  Gender
2  Claire   27  Female

In [49]:
df1 = df[['Name','Age']]
df1

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [50]:
#Ans:6- DataFrame is mutable

In [53]:
#Ans:7:-
Name = pd.Series(['Tiger','Lion','Deer','Horse'])
Weight = pd.Series([90,110,45,80])
Speed = pd.Series([70,60,81,91])
data = [Name,Weight,Speed]

In [59]:
Animal = pd.DataFrame(data)

In [60]:
Animal

       0     1     2      3
0  Tiger  Lion  Deer  Horse
1     90   110    45     80
2     70    60    81     91